In [2]:
import pandas as pd
from pandas import Series

In [3]:
obj = Series([3, 6, 9,12])

In [4]:
obj

0     3
1     6
2     9
3    12
dtype: int64

In [5]:
obj.values

array([ 3,  6,  9, 12])

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
ww2_cos = Series([87, 43, 30, 21, 40], index=['USSR', 'Gremany', 'China', 'Japan', 'USA'])

In [9]:
ww2_cos

USSR       87
Gremany    43
China      30
Japan      21
USA        40
dtype: int64

In [10]:
ww2_cos['USA']

40

In [11]:
ww2_cos[ww2_cos>40]

USSR       87
Gremany    43
dtype: int64

In [12]:
ww2_cos>40

USSR        True
Gremany     True
China      False
Japan      False
USA        False
dtype: bool

In [17]:
#こんな感じでも使える! 
'USSR' in ww2_cos

True

In [18]:
ww2_dict = ww2_cos.to_dict()

In [19]:
ww2_dict

{'USSR': 87, 'Gremany': 43, 'China': 30, 'Japan': 21, 'USA': 40}

In [20]:
ww2_Series= Series(ww2_dict)

In [21]:
ww2_Series

USSR       87
Gremany    43
China      30
Japan      21
USA        40
dtype: int64

In [25]:
countries = ['China', 'Germany', 'Japan', 'USA', 'USSR', 'Argentina']

In [26]:
obj2 = Series(ww2_dict, index= countries)

In [27]:
obj2

China        30.0
Germany       NaN
Japan        21.0
USA          40.0
USSR         87.0
Argentina     NaN
dtype: float64

In [28]:
pd.isnull(obj2)

China        False
Germany       True
Japan        False
USA          False
USSR         False
Argentina     True
dtype: bool

In [29]:
pd.notnull(obj2)

China         True
Germany      False
Japan         True
USA           True
USSR          True
Argentina    False
dtype: bool

In [30]:
ww2_Series

USSR       87
Gremany    43
China      30
Japan      21
USA        40
dtype: int64

In [31]:
obj2

China        30.0
Germany       NaN
Japan        21.0
USA          40.0
USSR         87.0
Argentina     NaN
dtype: float64

In [32]:
ww2_Series + obj2

Argentina      NaN
China         60.0
Germany        NaN
Gremany        NaN
Japan         42.0
USA           80.0
USSR         174.0
dtype: float64

In [33]:
obj2.name = u '第二次世界大戦'

In [34]:
obj2

China        30.0
Germany       NaN
Japan        21.0
USA          40.0
USSR         87.0
Argentina     NaN
Name: 第二次世界大戦, dtype: float64

In [35]:
obj2.index.name = 'Countries'

In [36]:
obj2

Countries
China        30.0
Germany       NaN
Japan        21.0
USA          40.0
USSR         87.0
Argentina     NaN
Name: 第二次世界大戦, dtype: float64

In [38]:
import numpy as np
from pandas import DataFrame

In [48]:
nfl_frame = pd.read_clipboard() 
# docker環境ではclipboardにアクセスできないから動かないみたい...

PyperclipException:
    Pyperclip could not find a copy/paste mechanism for your system.
    For more information, please visit https://pyperclip.readthedocs.org

In [44]:
data = { 'City': ['SF', 'LA', 'NYC'], 'Population': [837, 388, 840]}

In [45]:
data

{'City': ['SF', 'LA', 'NYC'], 'Population': [837, 388, 840]}

In [46]:
city_frame = DataFrame(data)

In [47]:
city_frame

  City  Population
0   SF         837
1   LA         388
2  NYC         840

In [49]:
my_ser = Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])

In [50]:
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [51]:
my_index = my_ser.index

In [52]:
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [53]:
my_index[0]

'A'

In [54]:
my_index[2:]

Index(['C', 'D'], dtype='object')

In [56]:
my_index[0] = '2' # immutableになっている

TypeError: Index does not support mutable operations

In [58]:
from numpy.random import randn

In [59]:
ser1 = Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])

In [60]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [61]:
ser2 = ser1.reindex(['A', 'B', 'C', 'D', 'E', 'F'])

In [62]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [65]:
ser2.reindex(['A', 'B', 'C', 'D', 'E', 'F', 'G'], fill_value = 0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [66]:
ser3 = Series(['USA', 'Mexico', 'Canada'], index=[0, 5, 10])

In [67]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [68]:
ser3.reindex(range(15), method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [72]:
dframe = DataFrame(randn(25).reshape((5, 5)), index=['A', 'B',  'D', 'E', 'F'], columns=['col1', 'col2', 'col3', 'col4', 'col5'])

In [73]:
dframe

       col1      col2      col3      col4      col5
A -0.618159  0.967394 -0.727905  0.553115 -0.520613
B -0.479125  1.037272  0.923622  0.169947  1.101911
D -1.127064  0.327772 -0.102461  0.169350  0.283162
E -0.674915 -2.100978 -0.011489 -0.120369 -1.366648
F -0.471017  0.865484  0.923804 -0.376500 -0.480698

In [74]:
new_index = ['A', 'B',  'C', 'D', 'E', 'F']
dframe2 = dframe.reindex(new_index)

In [75]:
dframe2

       col1      col2      col3      col4      col5
A -0.618159  0.967394 -0.727905  0.553115 -0.520613
B -0.479125  1.037272  0.923622  0.169947  1.101911
C       NaN       NaN       NaN       NaN       NaN
D -1.127064  0.327772 -0.102461  0.169350  0.283162
E -0.674915 -2.100978 -0.011489 -0.120369 -1.366648
F -0.471017  0.865484  0.923804 -0.376500 -0.480698

In [76]:
new_columns = ['col1', 'col2', 'col3', 'col4', 'col5', 'col6']

In [77]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.618159  0.967394 -0.727905  0.553115 -0.520613   NaN
B -0.479125  1.037272  0.923622  0.169947  1.101911   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.127064  0.327772 -0.102461  0.169350  0.283162   NaN
E -0.674915 -2.100978 -0.011489 -0.120369 -1.366648   NaN
F -0.471017  0.865484  0.923804 -0.376500 -0.480698   NaN

In [78]:
dframe

       col1      col2      col3      col4      col5
A -0.618159  0.967394 -0.727905  0.553115 -0.520613
B -0.479125  1.037272  0.923622  0.169947  1.101911
D -1.127064  0.327772 -0.102461  0.169350  0.283162
E -0.674915 -2.100978 -0.011489 -0.120369 -1.366648
F -0.471017  0.865484  0.923804 -0.376500 -0.480698

In [80]:
dframe.ix[new_index, new_columns]

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

       col1      col2      col3      col4      col5  col6
A -0.618159  0.967394 -0.727905  0.553115 -0.520613   NaN
B -0.479125  1.037272  0.923622  0.169947  1.101911   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.127064  0.327772 -0.102461  0.169350  0.283162   NaN
E -0.674915 -2.100978 -0.011489 -0.120369 -1.366648   NaN
F -0.471017  0.865484  0.923804 -0.376500 -0.480698   NaN

In [82]:
ser4 = Series(np.arange(3), index=['a', 'b', 'c'])

In [83]:
ser4

a    0
b    1
c    2
dtype: int64

In [84]:
ser4.drop('b')

a    0
c    2
dtype: int64

In [85]:
dframe = DataFrame(np.arange(9).reshape((3, 3)), index=['SF', 'LA', 'NY'], columns = ['pop', 'size', 'year'])

In [86]:
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [90]:
dframe.drop('LA', axis=0)

    pop  size  year
SF    0     1     2
NY    6     7     8

In [88]:
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [89]:
dframe.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [91]:
ser5 = Series(np.arange(3), index=['A', 'B', 'C'])

In [92]:
ser5 =2*ser5

In [93]:
ser5

A    0
B    2
C    4
dtype: int64

In [94]:
ser5['B']

2

In [95]:
ser5[1]

2

In [96]:
ser5[0:3]

A    0
B    2
C    4
dtype: int64

In [97]:
ser5[['A', 'B']]

A    0
B    2
dtype: int64

In [98]:
ser5[ser5>3]

C    4
dtype: int64

In [99]:
ser5[ser5>3] = 10

In [100]:
ser5

A     0
B     2
C    10
dtype: int64

In [102]:
dframe3 = DataFrame(np.arange(25).reshape((5,5)), index=['NYC', 'LA', 'SF', 'DC', 'Chi'], columns=['A', 'B', 'C', 'D', 'E'])

In [103]:
dframe3

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [105]:
dframe3[['B', 'C']]

      B   C
NYC   1   2
LA    6   7
SF   11  12
DC   16  17
Chi  21  22

In [106]:
dframe3[dframe3['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [107]:
dframe3>10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [108]:
dframe3.ix['LA']

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [110]:
dframe3.ix[1]
# ixはdeprecatedになっている

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [111]:
ser6 = Series([0,1,2], index=['A', 'B', 'C'])

In [112]:
ser6

A    0
B    1
C    2
dtype: int64

In [113]:
ser7 = Series([3, 4,5 ,6], index=['A', 'B', 'C', 'D'])

In [114]:
ser7

A    3
B    4
C    5
D    6
dtype: int64

In [115]:
ser6+ser7

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [116]:
dframe4 = DataFrame(np.arange(4).reshape((2,2)), columns=list('AB'), index=['NYC', 'LA'])

In [117]:
dframe4

     A  B
NYC  0  1
LA   2  3

In [118]:
dframe5 = DataFrame(np.arange(9).reshape((3,3)), columns=list('ADC'), index=['NYC', 'SF', 'LA'])

In [119]:
dframe5

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [120]:
dframe4+dframe5

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [121]:
dframe4.add(dframe5, fill_value=0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [122]:
dframe5

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [123]:
ser8 = dframe5.ix[0]

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [124]:
ser8

A    0
D    1
C    2
Name: NYC, dtype: int64

In [125]:
dframe5 - ser8

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6

In [126]:
ser9 = Series(range(3), index=['C', 'A', 'B'])

In [127]:
ser9

C    0
A    1
B    2
dtype: int64

In [128]:
ser9.sort_index()

A    1
B    2
C    0
dtype: int64

In [129]:
ser9

C    0
A    1
B    2
dtype: int64

In [130]:
ser9.order()

AttributeError: 'Series' object has no attribute 'order'

In [131]:
from numpy.random import randn

In [132]:
ser10 = Series(randn(10))

In [133]:
ser10

0   -1.824828
1    0.515583
2    0.529204
3    0.093829
4   -0.354455
5   -0.792937
6   -0.950790
7    0.842708
8   -0.347130
9    1.155227
dtype: float64

In [134]:
ser10.rank()

0     1.0
1     7.0
2     8.0
3     6.0
4     4.0
5     3.0
6     2.0
7     9.0
8     5.0
9    10.0
dtype: float64

In [136]:
ser10.sort()
# sortはもう使えないのかも...?

AttributeError: 'Series' object has no attribute 'sort'

In [137]:
arr = np.array([[1,2, np.nan], [np.nan, 3, 4]])

In [138]:
arr

array([[ 1.,  2., nan],
       [nan,  3.,  4.]])

In [139]:
dframe6 = DataFrame(arr, index=['A', 'B'], columns=['One', 'Two', 'Three'])

In [140]:
dframe6

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [141]:
dframe6.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [142]:
dframe6.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [143]:
dframe6.idxmin()

One      A
Two      A
Three    B
dtype: object

In [144]:
dframe6.cumsum()

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [145]:
dframe6.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [148]:
from numpy import nan

In [149]:
data = Series(['one', 'two', nan, 'four'])

In [150]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [151]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [152]:
dframe7 = DataFrame([[1,2,3], [nan, 5, 6], [7, nan, 9], [nan, nan, nan]])

In [153]:
dframe7

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [155]:
dframe7.dropna() #NaNがある行をdrop

     0    1    2
0  1.0  2.0  3.0

In [156]:
dframe7.dropna(how='all') #全てNaNの行をdrop

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [157]:
dframe7.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [160]:
dframe8 = DataFrame([[1,2,3, nan], [2, nan, 5, 6], [nan, 7, nan, 9], [1, nan, nan, nan]])

In [161]:
dframe8

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [162]:
dframe8.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [163]:
dframe8.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [164]:
dframe8.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [165]:
dframe8

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [167]:
dframe8.fillna({0:0, 1:1, 2:2, 3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [171]:
dframe8.fillna(0, inplace=True) # 欠損値の0埋め

In [172]:
dframe8

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [173]:
ser10 = Series(np.random.randn(6), index=[[1,1,1,2,2,2], ['a', 'b', 'c', 'a', 'b', 'c']])

In [174]:
ser10

1  a    1.760086
   b   -0.808938
   c   -0.693465
2  a    0.575748
   b    0.796308
   c   -2.759010
dtype: float64

In [175]:
ser10.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [177]:
ser10[1]

a    1.760086
b   -0.808938
c   -0.693465
dtype: float64

In [178]:
ser10

1  a    1.760086
   b   -0.808938
   c   -0.693465
2  a    0.575748
   b    0.796308
   c   -2.759010
dtype: float64

In [179]:
ser10[:, 'a']

1    1.760086
2    0.575748
dtype: float64

In [180]:
dframe9 = ser10.unstack()

In [181]:
dframe9

          a         b         c
1  1.760086 -0.808938 -0.693465
2  0.575748  0.796308 -2.759010

In [182]:
dframe9.unstack()

a  1    1.760086
   2    0.575748
b  1   -0.808938
   2    0.796308
c  1   -0.693465
   2   -2.759010
dtype: float64

In [183]:
dframe9.T.unstack()

1  a    1.760086
   b   -0.808938
   c   -0.693465
2  a    0.575748
   b    0.796308
   c   -2.759010
dtype: float64

In [184]:
dframe10 = DataFrame(np.arange(16).reshape((4,4)),
                    index=[['a', 'a', 'b', 'b'], [1,2,1, 2]],
                    columns=[['NY', 'NY', 'LA', 'SF'], ['cold', 'hot', 'hot', 'cold']])

In [185]:
dframe10

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [196]:
dframe10.index.names = ['INDEX_1', 'INDEX_2']

In [197]:
dframe10

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [198]:
dframe10.columns.names = ['Cities', 'Temp']

In [199]:
dframe10

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [200]:
dframe10.swaplevel('Cities', 'Temp', axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [201]:
dframe10.sortlevel(1)

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
b       1          8   9  10   11
a       2          4   5   6    7
b       2         12  13  14   15

In [202]:
dframe10.sortlevel(1).sortlevel(0)

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [203]:
dframe10.sum(level='Temp', axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27